# TableMergedCell Constructor (Int32, Int32, Int32, Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableMergedCell Constructor (Int32, Int32, Int32, Int32)
TableMergedCell Class See Also
---
Constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TableMergedCell(
	int top,
	int left,
	int bottom,
	int right
)
```

Visual Basic
---
```text
Public Sub New ( _
	top As Integer, _
	left As Integer, _
	bottom As Integer, _
	right As Integer _
)
```

Visual C++
---
```text
public:
TableMergedCell(
	int top,
	int left,
	int bottom,
	int right
)
```

# ### Parameters
top
    Type: System..::..Int32 Row index of the top-left of a table grid.
left
    Type: System..::..Int32 Column index of the top-left of a table grid.
bottom
    Type: System..::..Int32 Row index of the bottom-right of a table grid.
right
    Type: System..::..Int32 Column index of the bottom-right of a table grid.
# See Also
TableMergedCell Class
TableMergedCell Overload
Autodesk.Revit.DB Namespace